using Microsoft.VisualStudio.TestTools.UnitTesting;

namespace DDDTest.Tests
{
    [TestClass]
    public class UnitTest1
    {
        [TestMethod]
        public void TestMethod1()
        {
            // テストしたいプロジェクトの参照を追加
            // TestMethod1の中でテストしたいクラスのメソッドを使ってえられる値を検証値として受け取る
            // Assert.AreEqual（{期待値} , {検証値}) で検証値が期待値と一致するかを確認する

            // テストのしやすさ
            // テスト対象のメソッド内やクラス内で完結しているとテスト容易性が高い
            // 外部（DBなど）へ接触している処理はテスト容易性が低い
            // テスト容易性が低い箇所は極力テストを行わない代わりにそのロジックに接触する部分をInterfaceで切り分ける

            // TDD
            // TDDでは実装より前にテストコードを書いていく
            // 実装がないのでテストコード記述中はコンパイルエラーが出続けるが構わず書いていく
            // あえてエラーがでるようなコードを書いたら実装を行いコンパイルエラーを解消する
            // テスト可能になったらテストを実行し意図通りエラーがでるかを確認する
            // エラーが出たのを確認したら正常終了するように期待値を書き換えて、テストが通るのを確認する
        }
    }
}
